Repository: necrose99/Myaamia
Catalog: Algic_Master_Final.tmx
Source language: en_us
Languages: mia

source: you're welcome
mia: iihia

source: no
mia: moohci

source: Miami
mia: Myaamia

source: I said no
mia: moohci noonk

source: Thirty five, 35
mia: nihswi mateeni yaalanwaasi

source: not
mia: moohci

source: Hello
mia: Aya

source: yes
mia: naaka

source: affirmative
mia: iihia

source: okay
mia: iihia

source: Nobody
mia: moohci aweeya

source: No, I cannot
mia: moohci, niiši neehi

source: Not now
mia: moohci noonki

source: welcome
mia: meentitohkaalilaanki

source: One, 1
mia: nkoti

source: two
mia: niišwi

source: Three,
mia: nihswi

source: Six
mia: kaakaathswi

source: Seven
mia: swaahteethswi

source: Eight
mia: palaani

source: Ten
mia: mataathswi

source: Eleven
mia: mataathswi nkotaasi

source: Twelve, 12
mia: mataathswi niišwaasi

source: Thirteen, 13
mia: mataathswi nihswaasi

source: Fourteen, 14
mia: mataathswi niiwaasi

source: Fifteen, 15
mia: mataathswi yaalanwaasi

source: Sixteen, 16
mia: mataathswi kaakaathswaasi

source: Seventeen, 17
mia: mataathswi swaahteethswaasi

source: Eighteen, 18
mia: mataathswi palaanaasi

source: numerals
mia: akincikoona

source: Nineteen
mia: mataathswi nkotimeneehkaasi

source: Twenty
mia: niišwi mateeni

source: Twenty one
mia: niišwi mateeni nkotaasi

source: Twenty two,
mia: niišwi mateeni niišwaasi

source: Twenty three, 23
mia: niišwi mateeni nihswaasi

source: Twenty four, 24
mia: niišwi mateeni niiwaasi

source: Twenty five, 25
mia: niišwi mateeni yaalanwaasi

source: Twenty six, 26
mia: niišwi mateeni kaakaathswaasi

source: Twenty seven
mia: niišwi mateeni swaahteethswaasi

source: Twenty eight, 28
mia: niišwi mateeni palaanaasi

source: Twenty nine, 29
mia: niišwi mateeni nkotimeneehkaasi

source: Thirty
mia: nihswi mateeni

source: Forty
mia: niiwi mateeni

source: Fifty, 50
mia: yaalanwi mateeni

source: One hundred
mia: nkotwaahkwe

source: Two hundred, 200
mia: niišwaahkwe

source: One thousand, 1000
mia: mataathswaahkwe

source: Miami Language’ Online Resources
mia: Myaamiaataweenki

source: Myaamia ETHNOBOTANICAL DATABASE
mia: Mahkihkiwa

source: Miami Tribe’s revitalization movement
mia: Myaamiaki Eemamwiciki

source: Myaamia Heritage Museum & Archive
mia: Kaakisitoonkia

source: corn
mia: Miincipi

source: beech tree
mia: šeešaakamiš

source: false pennyroyal
mia: peecihsakahki

source: hazelnut
mia: pahkiihteenhsaahkwi

source: Welcome
mia: Aya

source: American hophornbeam
mia: myaalwamiši

source: Hornbeam
mia: myaalwamiši

source: sycamore
mia: kaakhšaahkatw

source: basswood
mia: wiikapimiši

source: beet
mia: neehpikiciiphkiki

source: black huckleberry
mia: pinkomini

source: black oak
mia: maamhkatiaahkatwi

source: black walnut tree
mia: aayoonseekaahkwi

source: blue ash
mia: sakikansia

source: blueberry
mia: pinkomini

source: box elder
mia: šiihšiikweekihsi

source: bur oak
mia: mihšiinkweemiši

source: butterfly milkweed
mia: alemontehsa

source: butternut tree
mia: kiinošiši

source: cabbage
mia: waapinkopakahki

source: paper birch
mia: wiikweehsimiši

source: cattail
mia: apahkwaya

source: {{Short description|Algonquian language of the Midwestern US}} {{Infobox language | name = Miami-Illinois | nativename = {{Lang|mia|Myaamia}}, {{Lang|mia|Irenwee}} | pronunciation = {{IPA|[mjɑːmia]|lang=mia}} | states = [[United States]] | region = [[Illinois]], [[Indiana]], [[Kansas]], [[Michigan]], [[Ohio]], [[Oklahoma]] | extinct = mid-20th century | ref = e18 | revived = a small number of users in revival program<ref>{{cite web|title=How the Miami Tribe got its language back|url=https://www.pri.org/stories/2016-10-14/how-miami-tribe-got-its-language-back|website=Public Radio International|archive-url=https://web.archive.org/web/20231214002843/https://theworld.org/stories/2016-10-14/how-miami-tribe-got-its-language-back|archive-date=December 14, 2023}}</ref> | familycolor = Algic | fam1 = [[Algic languages|Algic]] | fam2 = [[Algonquian languages|Algonquian]] | iso3 = mia | glotto = miam1252 | glottorefname = Miami | map = Lang Status 01-EX.svg | mapcaption = {{center|{{small|Miami-Illinois is classified as Extinct by the [[UNESCO]] [[Atlas of the World's Languages in Danger]]}}}}<ref>{{cite report |title=Atlas of the World's Languages in Danger |publisher=UNESCO |edition=3rd |url=https://unesdoc.unesco.org/ark:/48223/pf0000187026 |date=2010 |page=11}}</ref> }}
mia: MyaamiaQUERY LENGTH LIMIT EXCEDEED. MAX ALLOWED QUERY : 500 CHARS
